# Parameter Type Id Array Type Index Property

Source: https://www.revitapidocs.com/2026/ce1f6866-5e1d-530c-e974-ea6037e1e355.htm

---

| Parameter Type Id Array Type Index Property |
| --- |

"Array type"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId ArrayTypeIndex { get; }
```

```
Public Shared ReadOnly Property ArrayTypeIndex As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ ArrayTypeIndex {
	ForgeTypeId^ get ();
}
```

```
static member ArrayTypeIndex : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace